> > Terraform plan looks ok, except possibly this:
> > ```
> > # google_compute_backend_bucket.firmware_artefacts_ci[0] must be replaced
> > -/+ resource "google_compute_backend_bucket" "firmware_artefacts_ci" {
> >       ~ creation_timestamp      = "2023-11-06T07:43:36.660-08:00" -> (known after apply)
> >       - custom_response_headers = [] -> null
> >       ~ description             = "Contains CI firmware artefacts for FT log" -> "Contains CI firmware artefacts for FT log 0"
> >       ~ id                      = "projects/1071548024491/global/backendBuckets/firmware-artefacts-ci-backend" -> (known after apply)
> >       ~ name                    = "firmware-artefacts-ci-backend" -> "firmware-artefacts-ci-backend-0" # forces replacement
> >       ~ self_link               = "https://www.googleapis.com/compute/v1/projects/armored-witness/global/backendBuckets/firmware-artefacts-ci-backend" -> (known after apply)
> >         # (3 unchanged attributes hidden)
> >     }
> > 
> >   # google_compute_backend_bucket.firmware_log_ci[0] must be replaced
> > -/+ resource "google_compute_backend_bucket" "firmware_log_ci" {
> >       ~ creation_timestamp      = "2023-11-06T07:43:36.438-08:00" -> (known after apply)
> >       - custom_response_headers = [] -> null
> >       ~ description             = "Contains CI firmware transparency log" -> "Contains CI firmware transparency log 0"
> >       ~ id                      = "projects/1071548024491/global/backendBuckets/firmware-log-ci-backend" -> (known after apply)
> >       ~ name                    = "firmware-log-ci-backend" -> "firmware-log-ci-backend-0" # forces replacement
> >       ~ self_link               = "https://www.googleapis.com/compute/v1/projects/armored-witness/global/backendBuckets/firmware-log-ci-backend" -> (known after apply)
> >         # (3 unchanged attributes hidden)
> >     }
> > ```
> > 
> > 
> >     
> >       
> >     
> > 
> >       
> >     
> > 
> >     
> >   
> > Is the bucket name change and replacement for the backends okay?
> 
> So long as the bucket names match the bucket resources it should be fine I think.
> 
> Do you think we'll be able to use the same `count` trick on the paths in the LB too?

I tried to do it for the `path_rule`s, but got this error: `The "count" object can only be used in "module", "resource", and "data" blocks, and only when the "count" argument is set.` I think we'd need to figure out something smarter with path matching if it's supported by the module?